Revit 2027 API
BuiltInFailures.GlobalParameterFailures.GlobalParamFormulaCircularChainError Property
 A formula in a global parameter causes a circular chain of references between highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GlobalParamFormulaCircularChainError { get; }
Public Shared ReadOnly Property GlobalParamFormulaCircularChainError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GlobalParamFormulaCircularChainError {
	FailureDefinitionId^ get ();
}
static member GlobalParamFormulaCircularChainError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace